app/controllers/image_controller.rb

  def all
    images = Image.all
---
SELECT "images".* FROM "images"

  def save
    image = Image.new(save_image_params)
    unless image.save
---
INSERT INTO "images" ("description", "owner", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "iron rails"], ["owner", "Ricardo da Verdade Silva"], ["created_at", "2020-03-18 15:43:59.900011"], ["updated_at", "2020-03-18 15:43:59.900011"]]